app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "vendor_id", "list_price", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "product1"], ["vendor_id", 2], ["list_price", "123.0"], ["code", "b2ef8e32c70daa2243ac"], ["created_at", "2020-05-13 06:50:44.672432"], ["updated_at", "2020-05-13 06:50:44.672432"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save