app/controllers/admin/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."deleted_at" IS NULL

  def create
    @vendor = Vendor.new(vendor_params)
    if @vendor.save
---
INSERT INTO "vendors" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ggg"], ["description", "123"], ["created_at", "2020-05-12 07:01:19.884807"], ["updated_at", "2020-05-12 07:01:19.884807"]]

  def update
    if @vendor.update(vendor_params)
---
UPDATE "vendors" SET "description" = $1, "updated_at" = $2 WHERE "vendors"."id" = $3  [["description", "test123"], ["updated_at", "2020-05-12 06:37:17.926731"], ["id", 1]]

  def destroy
    @vendor.destroy
---
DELETE FROM "vendors" WHERE "vendors"."id" = $1  [["id", 1]]

  def find_vendor
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."deleted_at" IS NULL AND "vendors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]